littleboot/ACRE/Firmware/Libraries/GD32F10x_Firmware_Library_V2.1.2/Examples/USBFS/USB_Device/Audio/src/gd3210c_audio_codec.c
/*!
    \file  gd3210c_audio_codec.c
    \brief This file includes the low layer driver for CS43L22 Audio Codec

    \version 2014-12-26, V1.0.0, firmware for GD32F10x
    \version 2017-06-20, V2.0.0, firmware for GD32F10x
    \version 2018-07-31, V2.1.0, firmware for GD32F10x
*/

/*
    Copyright (c) 2018, GigaDevice Semiconductor Inc.

    All rights reserved.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

/* Includes ------------------------------------------------------------------*/
#include "gd3210c_audio_codec.h"

/* Private define ------------------------------------------------------------*/

/* Mask for the bit EN of the I2S CFGR register */
#define I2S_ENABLE_MASK                 (0x0400)

/* Delay for the Codec to be correctly reset */
#define CODEC_RESET_DELAY               (0x4FFF)

/* Codec audio Standards */
#ifdef I2S_STANDARD_PHILLIPS
    #define CODEC_STANDARD                 0x04
    #define I2S_STANDARD                   I2S_STD_PHILLIPS
#elif defined(I2S_STANDARD_MSB)
    #define CODEC_STANDARD                 0x00
    #define I2S_STANDARD                   I2S_STD_MSB
#elif defined(I2S_STANDARD_LSB)
    #define CODEC_STANDARD                 0x08
    #define I2S_STANDARD                   I2S_STD_LSB
#else 
    #error "Error: No audio communication standard selected !"
#endif /* I2S_STANDARD */

/* The 7 bits Codec adress (sent through I2C interface) */
#define CODEC_ADDRESS                      0x94  /* b00100111 */

/* Private variables ---------------------------------------------------------*/
/* This structure is declared glabal because it is handled by two different functions */
static dma_parameter_struct DMA_InitStructure;
static uint8_t OutputDev = 0;

uint32_t AudioTotalSize = 0xFFFF; /* This variable holds the total size of the audio file */
uint32_t AudioRemSize   = 0xFFFF; /* This variable holds the remaining data in audio file */
uint16_t *CurrentPos;             /* This variable holds the current poisition of audio pointer */
uint32_t I2S_AudioFreq = 0;


/* Private functions ---------------------------------------------------------*/

/* Audio Codec functions */

/* Low layer codec functions */
static void     Codec_CtrlInterface_Init    (void);
static void     Codec_CtrlInterface_DeInit  (void);
static void     Codec_AudioInterface_Init   (uint32_t AudioFreq);
static void     Codec_AudioInterface_DeInit (void);
static void     Codec_Reset                 (void);
static uint32_t Codec_WriteRegister         (uint32_t RegisterAddr, uint32_t RegisterValue);
static void     Codec_GPIO_Init             (void);
static void     Codec_GPIO_DeInit           (void);
static void     Delay                       (__IO uint32_t nCount);


/**
  * @brief  Configure the audio peripherals.
  * @param  OutputDevice:
  *   This parameter can be any one of the following values:
  *     @arg OUTPUT_DEVICE_SPEAKER
  *     @arg OUTPUT_DEVICE_HEADPHONE
  *     @arg OUTPUT_DEVICE_BOTH
  *     @arg OUTPUT_DEVICE_AUTO
  * @param  Volume: Initial volume level (from 0 (Mute) to 100 (Max))
  * @param  AudioFreq: Audio frequency used to paly the audio stream.
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t EVAL_AUDIO_Init(uint16_t OutputDevice, uint8_t Volume, uint32_t AudioFreq)
{
    /* Perform low layer Codec initialization */
    if (Codec_Init(OutputDevice, VOLUME_CONVERT(Volume), AudioFreq) != 0)
    {
        return 1;
    }
    else
    {
        /* I2S data transfer preparation:
           Prepare the Media to be used for the audio transfer from memory to I2S peripheral */
        Audio_MAL_Init();

        /* Return 0 when all operations are OK */
        return 0;
    }
}

/**
  * @brief  Dinitializes all the resources used by the codec (those initialized 
  *         by EVAL_AUDIO_Init() function) EXCEPT the I2C resources since they are 
  *         used by the IOExpander as well (and eventually other modules). 
  * @param  None.
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t EVAL_AUDIO_DeInit(void)
{
    /* DeInitialize the Media layer */
    Audio_MAL_DeInit();

    /* DeInitialize Codec */
    Codec_DeInit();

    return 0;
}

/**
  * @brief  Starts playing audio stream from a data buffer for a determined size. 
  * @param  pBuffer: Pointer to the buffer 
  * @param  Size: Number of audio data BYTES.
  * @retval OK if correct communication, else wrong communication
  */
uint32_t EVAL_AUDIO_Play(uint16_t* pBuffer, uint32_t Size)
{
    /* Set the total number of data to be played (count in half-word) */
    AudioTotalSize = Size/2;

    /* Call the audio Codec Play function */
    Codec_Play();

