littleboot/ACRE/Firmware/Libraries/GD32F10x_Firmware_Library_V2.1.2/Examples/USBFS/USB_Device/Audio/src/gd3210c_audio_codec.c
    /* Set the Slave Mode and the audio Standard */  
    counter += Codec_WriteRegister(0x06, CODEC_STANDARD);

    /* Set the Master volume */
    Codec_VolumeCtrl(Volume);

    /* If the Speaker is enabled, set the Mono mode and volume attenuation level */
    if (OutputDevice != OUTPUT_DEVICE_HEADPHONE)
    {
        /* Set the Speaker Mono mode */
        counter += Codec_WriteRegister(0x0F , 0x06);

        /* Set the Speaker attenuation level */
        counter += Codec_WriteRegister(0x24, 0x00);
        counter += Codec_WriteRegister(0x25, 0x00);
    }

    /* Power on the Codec */
    counter += Codec_WriteRegister(0x02, 0x9E);

    /* Additional configuration for the CODEC. These configurations are done to reduce
       the time needed for the Codec to power off. If these configurations are removed,
       then a long delay should be added between powering off the Codec and switching
       off the I2S peripheral MCLK clock (which is the operating clock for Codec).
       If this delay is not inserted, then the codec will not shut down propoerly and
       it results in high noise after shut down. */

    /* Disable the analog soft ramp */
    counter += Codec_WriteRegister(0x0A, 0x00);

    /* Disable the digital soft ramp */
    counter += Codec_WriteRegister(0x0E, 0x04);

    /* Disable the limiter attack level */
    counter += Codec_WriteRegister(0x27, 0x00);

    /* Adjust Bass and Treble levels */
    counter += Codec_WriteRegister(0x1F, 0x0F);

    /* Adjust PCM volume level */
    counter += Codec_WriteRegister(0x1A, 0x0A);
    counter += Codec_WriteRegister(0x1B, 0x0A);

    /* Configure the I2S peripheral */
    Codec_AudioInterface_Init(AudioFreq);

    /* Return communication control value */
    return counter;
}

/**
  * @brief  Restore the audio codec state to default state and free all used 
  *         resources.
  * @param  None.
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t Codec_DeInit(void)
{
    uint32_t counter = 0;

    /* Reset the Codec Registers */
    Codec_Reset();

    /* Keep Codec powered OFF */
    counter += Codec_WriteRegister(0x02, 0x01);    

    /* Deinitialize all use GPIOs */
    Codec_GPIO_DeInit();

    /* Disable the Codec control interface */
    Codec_CtrlInterface_DeInit();

    /* Deinitialize the Codec audio interface (I2S) */
    Codec_AudioInterface_DeInit(); 

    /* Return communication control value */
    return counter;  
}

/**
  * @brief  Start the audio Codec play feature.
  *         For this codec no Play options are required.
  * @param  None.
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t Codec_Play(void)
{
    /* No actions required on Codec level for play command */

    /* Return communication control value */
    return 0;
}

/**
  * @brief  Pauses and resumes playing on the audio codec.
  * @param  Cmd: AUDIO_PAUSE (or 0) to pause, AUDIO_RESUME (or any value different
  *         from 0) to resume. 
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t Codec_PauseResume(uint32_t Cmd)
{
    uint32_t counter = 0;

    /* Pause the audio file playing */
    if (Cmd == AUDIO_PAUSE)
    {
        /* Mute the output first */
        counter += Codec_Mute(AUDIO_MUTE_ON);

        /* Put the Codec in Power save mode */
        counter += Codec_WriteRegister(0x02, 0x01);
    }
    else /* AUDIO_RESUME */
    {
        /* Unmute the output first */
        counter += Codec_Mute(AUDIO_MUTE_OFF);

        counter += Codec_WriteRegister(0x04, OutputDev);

        /* Exit the Power save mode */
        counter += Codec_WriteRegister(0x02, 0x9E); 
    }

    return counter;
}

/**
  * @brief  Stops audio Codec playing. It powers down the codec.
  * @param  CodecPdwnMode:
  *   This parameter can be any one of the following values:
  *     @arg CODEC_PDWN_SW: only mutes the audio codec. When resuming from this 
  *          mode the codec keeps the prvious initialization (no need to re-Initialize
  *          the codec registers)
  *     @arg CODEC_PDWN_HW: Physically power down the codec. When resuming from this
  *          mode, the codec is set to default configuration (user should re-Initialize
  *          the codec in order to play again the audio stream).
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t Codec_Stop(uint32_t CodecPdwnMode)
{
    uint32_t counter = 0;   

    /* Mute the output first */
    Codec_Mute(AUDIO_MUTE_ON);

    if (CodecPdwnMode == CODEC_PDWN_SW)
    {
        /* Power down the DAC and the speaker (PMDAC and PMSPK bits)*/
        counter += Codec_WriteRegister(0x02, 0x9F);
    }
    else /* CODEC_PDWN_HW */
    {
        /* Power down the DAC components */
        counter += Codec_WriteRegister(0x02, 0x9F);

        /* Wait at least 100ms */
        Delay(0xFFF);

        /* Reset The pin */
        //IOE_WriteIOPin(AUDIO_RESET_PIN, BitReset);
    }

    return counter;
}

/**
  * @brief  Highers or Lowers the codec volume level.
  * @param  Volume: a byte value from 0 to 255 (refer to codec registers 
  *         description for more details).
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t Codec_VolumeCtrl(uint8_t Volume)
{
    uint32_t counter = 0;

    if (Volume > 0xE6)
    {
        /* Set the Master volume */
        counter += Codec_WriteRegister(0x20, Volume - 0xE7);
        counter += Codec_WriteRegister(0x21, Volume - 0xE7);
    }
    else
    {
        /* Set the Master volume */
        counter += Codec_WriteRegister(0x20, Volume + 0x19);
        counter += Codec_WriteRegister(0x21, Volume + 0x19);
    }

    return counter;
}

/**
  * @brief  Enables or disables the mute feature on the audio codec.
  * @param  Cmd: AUDIO_MUTE_ON to enable the mute or AUDIO_MUTE_OFF to disable the
  *              mute mode.
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t Codec_Mute(uint32_t Cmd)
{
    uint32_t counter = 0;

